#include <stdio.h>

int main()
{
//	int num;
//	char c;

//	void *ptr = &num;
//	void *ptr;
//	printf("|%20.p|\n", NULL);		
//	printf("|%-16.p|\n", NULL);		
//	printf("|%20d|\n", -21);	
//	printf("|%-16.20d|\n", 0);		
//	printf("|%-16.20d|\n\n", 0);		
//	printf("|%6.d|\n\n", 0);			
	printf("|%p|\n\n", NULL);

//	long long num = 2147483649;
//	int n = num;
//	printf("n ; %d\n", n);
/*
	printf("|%.*c|\n", -2, 'c');		// |-0234   |
	printf("|%8.4d|\n", -234);		// |   -0234|
	printf("|%0.6d|\n", -234);		// |-000234|
	printf("|%06d|\n\n", -234);		// |-00234|
*/	
/*
	printf("|%010d|\n", -101);		// |-000000101|	width는 -부호 한공간으로 생각
	printf("|%.5d|\n", -10);		// |-00010|	precision은 숫자만 한공간으로 생각
	printf("|%-4.5d|\n\n", 10);		// |00010|
*/
//	printf("|%0*.*d|\n", 6, 2, 122);		// |12234|		
//	printf("|%0*.*d|\n", 6, 2, -122);		// |00010  |
//	printf("|%-.*d|\n", -1, 13);		// |000234|
//	printf("|%-6d|\n", 234);		// |234   |
//	printf("|%-4.d|\n\n", 234);		// |234 |
/*
	printf("|%-.6d|\n", 234);		// |000234|
	printf("|%-6d|\n", 234);		// |234   |
	printf("|%-d|\n", 234);			// |234|
	printf("|%-d|\n\n",  234);		// |234|
*/	
/*
	printf("|%*.*x|\n", 7, 5, 1140);	// |-00000101|
	printf("|%*.*d|\n", 7, 5, 1140);	
	printf("|%x|\n", 100);
	printf("|%*.*x|\n", -3, 5, 1000);	// |     -101|
	printf("|%x|\n", 1000);	// |     -101|
	printf("|%.*d|\n", -2, 0);		// ||
	printf("|%-d|\n\n", 0);			// |0|
*/
/*
	printf("|%6.8d|\n", -234);		// |-00000234|
	printf("|%0.3d|\n", -234);		// |-000234|
	printf("|%.0d|\n", -234);		// |-234|
	printf("|%.d|\n\n", -2);		// |-2|
	printf("|%6d|\n", -234);		// |  -234|
	printf("|%0.4d|\n", -234);		// |-234|
	printf("|%0.5d|\n", -234);		// |-234|
	printf("|%0.2d|\n", -234);		// |-234|
	printf("|%04d|\n", -234);		// |-234|
	printf("|%06d|\n", -234);		// |-234|
	printf("|%d|\n\n", -2);			// |-2|
*/
}